<?php

namespace Database\Seeders;

use App\Models\Area;
use Illuminate\Database\Seeder;

class AreaSeeder extends Seeder
{
    public function run(): void
    {
        $areas = [
            'المرج',
            'المطرية',
            'عين شمس',
            'عزبة النخل',
            'السلام',
            'النهضة',
            'النزهة',
            'مصر الجديدة',
            'مدينة نصر',
            'العباسية',
            'الوايلي',
            'حدائق القبة',
            'الزيتون',
            'الأميرية',
            'الشرابية',
            'الساحل',
            'شبرا',
            'روض الفرج',
            'الظاهر',
            'باب الشعرية',
            'الموسكي',
            'العتبة',
            'وسط البلد',
            'عابدين',
            'جاردن سيتي',
            'الزمالك',
            'السيدة زينب',
            'المنيل',
            'مصر القديمة',
            'الفسطاط',
            'دار السلام',
            'البساتين',
            'المعادي',
            'زهراء المعادي',
            'المعادي الجديدة',
            'طرة',
            'كوتسيكا',
            'المعصرة',
            'حلوان',
            'حدائق حلوان',
            '15 مايو',
            'التبين',
            'المقطم',
            'الخليفة',
            'الدرب الأحمر',
            'المنشية الجديدة',
            'التجمع الأول',
            'التجمع الثالث',
            'التجمع الخامس',
            'النرجس',
            'اللوتس',
            'بيت الوطن',
            'القطامية',
        ];

        foreach ($areas as $area) {
            Area::updateOrCreate([
                'name' => $area,
            ]);
        }
    }
}
